---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateIFCAggregate(Autodesk.Revit.DB.IFC.IFCAggregate)
source: html/8da552ee-b38a-3c91-651c-28973eada1f0.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateIFCAggregate Method

Creates an IFCAggregate data object.

## Syntax (C#)
```csharp
public static IFCData CreateIFCAggregate(
	IFCAggregate value
)
```

## Parameters
- **value** (`Autodesk.Revit.DB.IFC.IFCAggregate`) - The IFCAggregate value.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null